In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

#### Loading dictinary from file

In [4]:
uni_dict = np.load('example_dict.npy', allow_pickle=True).item()

In [5]:
uni_dict

{'Boston': ['Northeastern University', 'Boston University'],
 'London': ['UCL',
  'Kings College',
  'Queen Mary University',
  'Royal Holloway University'],
 'Oxford': ['Oxford University']}

In [6]:
uni_dict.keys()

dict_keys(['Boston', 'London', 'Oxford'])

#### dictionary to dataframe

In [7]:
df_rows = []
for k,v in uni_dict.items():
    print('key', k)
    print('value',v)
    for vv in v:
        print('this will be a row: ',[k,vv])
        df_rows.append([k,vv])

key Boston
value ['Northeastern University', 'Boston University']
this will be a row:  ['Boston', 'Northeastern University']
this will be a row:  ['Boston', 'Boston University']
key London
value ['UCL', 'Kings College', 'Queen Mary University', 'Royal Holloway University']
this will be a row:  ['London', 'UCL']
this will be a row:  ['London', 'Kings College']
this will be a row:  ['London', 'Queen Mary University']
this will be a row:  ['London', 'Royal Holloway University']
key Oxford
value ['Oxford University']
this will be a row:  ['Oxford', 'Oxford University']

In [8]:
df_rows

[['Boston', 'Northeastern University'],
 ['Boston', 'Boston University'],
 ['London', 'UCL'],
 ['London', 'Kings College'],
 ['London', 'Queen Mary University'],
 ['London', 'Royal Holloway University'],
 ['Oxford', 'Oxford University']]

In [9]:
uni_df = pd.DataFrame(df_rows, columns=['city','university'])

In [10]:
uni_df

     city                 university
0  Boston    Northeastern University
1  Boston          Boston University
2  London                        UCL
3  London              Kings College
4  London      Queen Mary University
5  London  Royal Holloway University
6  Oxford          Oxford University

#### apply function to column

In [11]:
x = uni_df['university'].iloc[0]
x

'Northeastern University'

In [12]:
x.split(' ')[0]

'Northeastern'

In [13]:
uni_df['university'].apply(lambda x: x.split(' ')[0])

0    Northeastern
1          Boston
2             UCL
3           Kings
4           Queen
5           Royal
6          Oxford
Name: university, dtype: object

In [14]:
x = uni_df['university'].iloc[5]
x

'Royal Holloway University'

In [15]:
x.replace(' University','')

'Royal Holloway'

In [16]:
uni_df['university'].apply(lambda x: x.replace(' University',''))

0      Northeastern
1            Boston
2               UCL
3     Kings College
4        Queen Mary
5    Royal Holloway
6            Oxford
Name: university, dtype: object

In [17]:
uni_df['univeristy_name'] = uni_df['university'].apply(lambda x: x.replace(' University',''))
uni_df

     city                 university univeristy_name
0  Boston    Northeastern University    Northeastern
1  Boston          Boston University          Boston
2  London                        UCL             UCL
3  London              Kings College   Kings College
4  London      Queen Mary University      Queen Mary
5  London  Royal Holloway University  Royal Holloway
6  Oxford          Oxford University          Oxford

#### apply function to multiple columns

In [18]:
uni_df.apply(lambda x: x.city + '_' + x.university, axis=1)

0      Boston_Northeastern University
1            Boston_Boston University
2                          London_UCL
3                London_Kings College
4        London_Queen Mary University
5    London_Royal Holloway University
6            Oxford_Oxford University
dtype: object

In [19]:
uni_df['city_plus_uni'] = uni_df.apply(lambda x: x.city + '_' + x.university, axis=1)
uni_df

,city,university,univeristy_name,city_plus_uni
0,Boston,Northeastern University,Northeastern,Boston_Northeastern University
1,Boston,Boston University,Boston,Boston_Boston University
2,London,UCL,UCL,London_UCL
3,London,Kings College,Kings College,London_Kings College
4,London,Queen Mary University,Queen Mary,London_Queen Mary University
5,London,Royal Holloway University,Royal Holloway,London_Royal Holloway University
6,Oxford,Oxford University,Oxford,Oxford_Oxford University

In [ ]:
# let's do exercises 1-2!

#### merging

In [49]:
df_x = uni_df[['city', 'university']].copy()
df_y = pd.DataFrame({'city':['London', 'Boston','New York'],
                    'country':['UK','USA','USA']})

In [50]:
df_x

     city                 university
0  Boston    Northeastern University
1  Boston          Boston University
2  London                        UCL
3  London              Kings College
4  London      Queen Mary University
5  London  Royal Holloway University
6  Oxford          Oxford University

In [51]:
df_y

       city country
0    London      UK
1    Boston     USA
2  New York     USA

<img src="join.png">

In [52]:
pd.merge(df_x, df_y, how='inner')

     city                 university country
0  Boston    Northeastern University     USA
1  Boston          Boston University     USA
2  London                        UCL      UK
3  London              Kings College      UK
4  London      Queen Mary University      UK
5  London  Royal Holloway University      UK

In [53]:
pd.merge(df_x, df_y, how='outer')

       city                 university country
0    Boston    Northeastern University     USA
1    Boston          Boston University     USA
2    London                        UCL      UK
3    London              Kings College      UK
4    London      Queen Mary University      UK
5    London  Royal Holloway University      UK
6    Oxford          Oxford University     NaN
7  New York                        NaN     USA

In [54]:
pd.merge(df_x, df_y, how='left')

     city                 university country
0  Boston    Northeastern University     USA
1  Boston          Boston University     USA
2  London                        UCL      UK
3  London              Kings College      UK
4  London      Queen Mary University      UK
5  London  Royal Holloway University      UK
6  Oxford          Oxford University     NaN

In [55]:
pd.merge(df_x, df_y, how='right')

       city                 university country
0    Boston    Northeastern University     USA
1    Boston          Boston University     USA
2    London                        UCL      UK
3    London              Kings College      UK
4    London      Queen Mary University      UK
5    London  Royal Holloway University      UK
6  New York                        NaN     USA

In [56]:
df_y = pd.DataFrame({'city_name':['London', 'Boston','New York'],
                    'country':['UK','USA','USA']})

In [57]:
pd.merge(df_x, df_y, how='left')

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [58]:
uni_with_location = pd.merge(df_x, df_y, how='left', left_on='city', right_on='city_name')

In [59]:
uni_with_location

     city                 university city_name country
0  Boston    Northeastern University    Boston     USA
1  Boston          Boston University    Boston     USA
2  London                        UCL    London      UK
3  London              Kings College    London      UK
4  London      Queen Mary University    London      UK
5  London  Royal Holloway University    London      UK
6  Oxford          Oxford University       NaN     NaN

#### merging on multiple columns

In [60]:
gdp = pd.DataFrame({'city':['London','London','Boston','Boston','New York','New York'],
                    'year':[2017,2018,2017,2018,2017,2018],
                    'GDP':[1,2,3,4,5,6]})
scholarship = pd.DataFrame({'university':['Queen Mary University','Royal Holloway University','Boston University', 'Queen Mary University','Royal Holloway University','Boston University'],
                    'year':[2017,2017,2017,2018,2018,2018],
                    'scholarship_avg':[1,2,3,4,5,6]})

In [61]:
gdp

       city  year  GDP
0    London  2017    1
1    London  2018    2
2    Boston  2017    3
3    Boston  2018    4
4  New York  2017    5
5  New York  2018    6

In [62]:
scholarship

                  university  year  scholarship_avg
0      Queen Mary University  2017                1
1  Royal Holloway University  2017                2
2          Boston University  2017                3
3      Queen Mary University  2018                4
4  Royal Holloway University  2018                5
5          Boston University  2018                6

In [63]:
uni_with_location

     city                 university city_name country
0  Boston    Northeastern University    Boston     USA
1  Boston          Boston University    Boston     USA
2  London                        UCL    London      UK
3  London              Kings College    London      UK
4  London      Queen Mary University    London      UK
5  London  Royal Holloway University    London      UK
6  Oxford          Oxford University       NaN     NaN

In [64]:
scholarship_with_city = pd.merge(scholarship, uni_with_location[['university','city']],
                                how='left')
scholarship_with_city

                  university  year  scholarship_avg    city
0      Queen Mary University  2017                1  London
1  Royal Holloway University  2017                2  London
2          Boston University  2017                3  Boston
3      Queen Mary University  2018                4  London
4  Royal Holloway University  2018                5  London
5          Boston University  2018                6  Boston

In [65]:
scholarship_with_city_GDP = pd.merge(scholarship_with_city, gdp,
                                    how='left', on=['city','year'])
scholarship_with_city_GDP

                  university  year  scholarship_avg    city  GDP
0      Queen Mary University  2017                1  London    1
1  Royal Holloway University  2017                2  London    1
2          Boston University  2017                3  Boston    3
3      Queen Mary University  2018                4  London    2
4  Royal Holloway University  2018                5  London    2
5          Boston University  2018                6  Boston    4

In [ ]:
# let's do exercise 3-4!

#### seaborn plots

In [ ]:
import seaborn as sns
#https://seaborn.pydata.org/examples/index.html

In [ ]:
scholarship_with_city_GDP.boxplot('GDP')

In [ ]:
sns.boxplot(data=scholarship_with_city_GDP, x='GDP', orient='v')

In [ ]:
scholarship_with_city_GDP.plot.bar(x='city',y='GDP')

In [ ]:
sns.barplot(data=scholarship_with_city_GDP, x='city', y='GDP')

In [ ]:
scholarship_with_city_GDP[['GDP']].hist()

In [ ]:
sns.distplot(scholarship_with_city_GDP['GDP'])

In [ ]:
scholarship_with_city_GDP.plot.scatter(x='scholarship_avg',y='GDP')

In [ ]:
sns.jointplot(data=scholarship_with_city_GDP, x='scholarship_avg',y='GDP')

In [ ]:
sns.lmplot(data=scholarship_with_city_GDP, x='scholarship_avg',y='GDP')

In [ ]:
sns.lmplot(data=scholarship_with_city_GDP, x='scholarship_avg',y='GDP', hue='city')

#### interactive plotting with bokeh

In [ ]:
import bokeh
from bokeh.io import show, output_notebook
from bokeh.plotting import figure, ColumnDataSource
from bokeh.models import HoverTool
output_notebook()

In [ ]:
p = figure( plot_width=600, plot_height=400)
p.scatter(x= scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='London']['scholarship_avg'],
           y=scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='London']['GDP'],
          color='lime', alpha=0.8, legend='London',
          marker='circle', size=15)
p.scatter(x= scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='Boston']['scholarship_avg'],
           y=scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='Boston']['GDP'],
          color='purple', alpha=0.8, legend='Boston',
         marker='circle', size=15)
p.legend.location = "top_left"
show(p)

In [ ]:

p = figure( plot_width=600, plot_height=400)
p.title.text = 'Click on legend entries to hide the corresponding lines'

p.scatter(x= scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='London']['scholarship_avg'],
           y=scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='London']['GDP'],
          color='lime', alpha=0.8, legend='London',
          muted_color='lime', muted_alpha=0.2,
          marker='circle', size=15)
p.scatter(x= scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='Boston']['scholarship_avg'],
           y=scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='Boston']['GDP'],
          color='purple', alpha=0.8, legend='Boston',
          muted_color='purple', muted_alpha=0.2,
         marker='circle', size=15)


p.legend.location = "top_left"
p.legend.click_policy="mute"#"hide"

show(p)

In [ ]:

p = figure( plot_width=600, plot_height=400)
p.title.text = "Mouse over the dots"

l_df = scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='London']
source = ColumnDataSource(l_df)
p.scatter(x= 'scholarship_avg',
           y='GDP',
          color='lime', alpha=0.8, legend='London',
          muted_color='lime', muted_alpha=0.2,
          marker='circle', size=15,
         source = source)

hover = HoverTool(tooltips=[("uni", "@university"),
                            ('year', '@year')])
p.add_tools(hover)

b_df = scholarship_with_city_GDP[scholarship_with_city_GDP['city']=='Boston']
source = ColumnDataSource(b_df)
p.scatter(x= 'scholarship_avg',
           y='GDP',
          color='purple', alpha=0.8, legend='Boston',
          muted_color='purple', muted_alpha=0.2,
         marker='circle', size=15,
         source = source)


p.add_tools(hover)
p.legend.location = "top_left"
p.legend.click_policy="mute"#"hide"

show(p)

In [ ]:
# let's do exercises 5-8!

### 1 - exercise

Load the zipcode_dict.npy file into a dictionary. <br>
Create a list (called df_rows) from the dictionary where each element looks like ['city','zipcode']. For each city there should be a row for all the corresponding zip codes.

In [24]:
### Your code here
zipcode_dict = np.load('zipcode_dict.npy', allow_pickle=True).item()

df_rows = []
for k,v in zipcode_dict.items():
    for vv in v:
        df_rows.append([k,vv])
        
df_rows

[['San Jose', '94088'],
 ['San Jose', ',94089'],
 ['San Jose', ',94538'],
 ['San Jose', ',94560'],
 ['San Jose', ',95002'],
 ['San Jose', ',95008'],
 ['San Jose', ',95013'],
 ['San Jose', ',95035'],
 ['San Jose', ',95037'],
 ['San Jose', ',95050'],
 ['San Jose', ',95054'],
 ['San Jose', ',95101'],
 ['San Jose', ',95103'],
 ['San Jose', ',95106'],
 ['San Jose', ',95108'],
 ['San Jose', ',95109'],
 ['San Jose', ',95110'],
 ['San Jose', ',95111'],
 ['San Jose', ',95112'],
 ['San Jose', ',95113'],
 ['San Jose', ',95115'],
 ['San Jose', ',95116'],
 ['San Jose', ',95117'],
 ['San Jose', ',95118'],
 ['San Jose', ',95119'],
 ['San Jose', ',95120'],
 ['San Jose', ',95121'],
 ['San Jose', ',95122'],
 ['San Jose', ',95123'],
 ['San Jose', ',95124'],
 ['San Jose', ',95125'],
 ['San Jose', ',95126'],
 ['San Jose', ',95127'],
 ['San Jose', ',95128'],
 ['San Jose', ',95129'],
 ['San Jose', ',95130'],
 ['San Jose', ',95131'],
 ['San Jose', ',95132'],
 ['San Jose', ',95133'],
 ['San Jose', ',95134'],
 ['San Jose', ',95135'],
 ['San Jose', ',95136'],
 ['San Jose', ',95138'],
 ['San Jose', ',95139'],
 ['San Jose', ',95141'],
 ['San Jose', ',95148'],
 ['San Jose', ',95150'],
 ['San Jose', ',95151'],
 ['San Jose', ',95152'],
 ['San Jose', ',95153'],
 ['San Jose', ',95154'],
 ['San Jose', ',95155'],
 ['San Jose', ',95156'],
 ['San Jose', ',95157'],
 ['San Jose', ',95158'],
 ['San Jose', ',95160'],
 ['San Jose', ',95161'],
 ['San Jose', ',95164'],
 ['San Jose', ',95170'],
 ['San Jose', ',95172'],
 ['San Jose', ',95173'],
 ['San Jose', ',95190'],
 ['San Jose', ',95191'],
 ['San Jose', ',95192'],
 ['San Jose', ',95193'],
 ['San Jose', ',95194'],
 ['San Jose', ',95196'],
 ['Redwood City', '94002'],
 ['Redwood City', ',94061'],
 ['Redwood City', ',94062'],
 ['Redwood City', ',94063'],
 ['Redwood City', ',94064'],
 ['Redwood City', ',94065'],
 ['Redwood City', ',94070'],
 ['Mountain View', '94039'],
 ['Mountain View', ',94040'],
 ['Mountain View', ',94041'],
 ['Mountain View', ',94042'],
 ['Mountain View', ',94043'],
 ['Mountain View', ',94085'],
 ['Mountain View', ',94303'],
 ['Palo Alto', '94020'],
 ['Palo Alto', ',94022'],
 ['Palo Alto', ',94024'],
 ['Palo Alto', ',94028'],
 ['Palo Alto', ',94301'],
 ['Palo Alto', ',94302'],
 ['Palo Alto', ',94303'],
 ['Palo Alto', ',94304'],
 ['Palo Alto', ',94306'],
 ['Palo Alto', ',95033'],
 ['San Francisco', '94016'],
 ['San Francisco', ',94102'],
 ['San Francisco', ',94103'],
 ['San Francisco', ',94104'],
 ['San Francisco', ',94105'],
 ['San Francisco', ',94107'],
 ['San Francisco', ',94108'],
 ['San Francisco', ',94109'],
 ['San Francisco', ',94110'],
 ['San Francisco', ',94111'],
 ['San Francisco', ',94112'],
 ['San Francisco', ',94114'],
 ['San Francisco', ',94115'],
 ['San Francisco', ',94116'],
 ['San Francisco', ',94117'],
 ['San Francisco', ',94118'],
 ['San Francisco', ',94119'],
 ['San Francisco', ',94120'],
 ['San Francisco', ',94121'],
 ['San Francisco', ',94122'],
 ['San Francisco', ',94123'],
 ['San Francisco', ',94124'],
 ['San Francisco', ',94125'],
 ['San Francisco', ',94126'],
 ['San Francisco', ',94127'],
 ['San Francisco', ',94129'],
 ['San Francisco', ',94130'],
 ['San Francisco', ',94131'],
 ['San Francisco', ',94132'],
 ['San Francisco', ',94133'],
 ['San Francisco', ',94134'],
 ['San Francisco', ',94137'],
 ['San Francisco', ',94139'],
 ['San Francisco', ',94140'],
 ['San Francisco', ',94141'],
 ['San Francisco', ',94142'],
 ['San Francisco', ',94143'],
 ['San Francisco', ',94144'],
 ['San Francisco', ',94145'],
 ['San Francisco', ',94146'],
 ['San Francisco', ',94147'],
 ['San Francisco', ',94151'],
 ['San Francisco', ',94153'],
 ['San Francisco', ',94154'],
 ['San Francisco', ',94156'],
 ['San Francisco', ',94158'],
 ['San Francisco', ',94159'],
 ['San Francisco', ',94160'],
 ['San Francisco', ',94161'],
 ['San Francisco', ',94162'],
 ['San Francisco', ',94163'],
 ['San Francisco', ',94164'],
 ['San Francisco', ',94171'],
 ['San Francisco', ',94172'],
 ['San Francisco', ',94177'],
 ['San Francisco', ',94188']]

### 1 - check yourself

In [25]:
if len(df_rows) == 147:
    print('Your list is correct')
else:
    print('Your list is NOT correct')

Your list is correct

### 2 - exercise

- Create a dataframe from the df_rows list, where the columns are called landmark az zipcode <br>
- Create a new column in the dataframe called zip that contains the values from the zipcode column without the ',' and converted into integer type
- Drop the zipcode column

In [48]:
### Your code here
zipdf = pd.DataFrame(df_rows, columns=['landmark','zipcode'])
zipdf['zip'] = zipdf.apply(lambda x: int(x.zipcode.strip(',')), axis=1)
zipdf.drop('zipcode', axis=1, inplace=True)
zipdf

          landmark    zip
0         San Jose  94088
1         San Jose  94089
2         San Jose  94538
3         San Jose  94560
4         San Jose  95002
..             ...    ...
142  San Francisco  94164
143  San Francisco  94171
144  San Francisco  94172
145  San Francisco  94177
146  San Francisco  94188

[147 rows x 2 columns]

### 2 - check yourself

In [45]:
if zipdf['zip'].dtype==int and len(zipdf) == 147:
    print('The dataframe is correct')
else:
    print('The dataframe is NOT correct')

The dataframe is NOT correct

### 3 - exercise
Load the trip, station and weather csv-s into pandas dataframes <br>
Join them on the appropriate columns and create a final dataframe called merged_df where there is a row for each trip with the weather conditions for the corresponding day in the corresponding city (landmark)

In [141]:
### Your code here
trip = pd.read_csv('trip.csv')
station = pd.read_csv('station.csv')
weather = pd.read_csv('weather.csv')

In [176]:
merged_df = pd.merge(station, zipdf, how='inner', left_on='zip_code', right_on='zip')
merged_df = pd.merge(trip, merged_df, how='inner', left_on='Start Station', right_on='name')
merged_df = pd.merge(merged_df, weather, how='inner', on=['date_to_join', 'landmark'])

### 3 - check yourself

In [177]:
if sorted(merged_df['Events'].value_counts().tolist()) == [498, 793, 10393, 11697, 120232]:
    print('The dataframe is correct')
else:
    print('The dataframe is NOT correct')

The dataframe is correct

### 4 - exercise

Create a new column in the merged_df called weekend where the value is True for Saturday and Sunday and False for the other days. If you want you can create helper column that contains the name of the day first

In [181]:
### Your code here
merged_df['day_of_week'] = pd.to_datetime(merged_df['date_to_join']).dt.weekday_name
merged_df['weekend'] = merged_df['day_of_week'].apply(lambda x: True if x == 'Saturday' or x == 'Sunday' else False)

### 4 - check yourself

In [182]:
if sorted(merged_df['weekend'].value_counts().tolist()) == [23046, 121128]:
    print('The weekend column is correct')
else:
    print('The weekend column is NOT correct')

The weekend column is NOT correct

In [183]:
merged_df['weekend'].value_counts().tolist()

[120767, 22846]

### 5 - exercise

We would like to plot the number of trips taken by Customers/Subscribers by the different weather conditions. Let's start with the Max_Temperature_F! <br>
Create a dataframe where we can find for each possible values of the Max_Temperature_F, how many trips were taken by Subscirption Type and weekend. It will be the easiest to plot if the dataframe is in long format: for each temperature value there are 4 rows: weekend - Customer, weeken - Subscriber, weekday - Customer, weekday - Subscriber. Name the columns containing the number of trips to num_trips.

In [ ]:
### Your code here

### 5 - check yourself

In [ ]:
if len(toplot) == 165:
    print('The dataframe is correct')
else:
    print('The dataframe is NOT correct')

### 6 - exercise
Use seaborn to lmplot to plot the relationship between the max temperature and the number of trips taken by Customers/Subscribers! Draw two separate plots for weekends and weekdays.

In [ ]:
### Your code here

### 7 - exercise

Use a for loop to draw similar charts for all numeric weather conditions!

In [ ]:
### Your code here

### 8 - exercise
Similarly as above, loop the numeric weather columns and draw a chart a weekend and a weekday chart for each variable. This time, calculate the customer/subscriber ratio and use the jointplot chart type to show it. You can draw a regression line on this type of chart as well. Check the documention to find the argument for it!

In [ ]:
### Your code here